benchmarks/results/20260908T1645Z_fp8kv-rx5/rx5-wperm-nt-quick/logs/prefill_in2048_out64_c4_r1.shape-warmup.log
INFO 09-08 17:25:33 [importing.py:45] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 09-08 17:25:33 [importing.py:69] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 09-08 17:25:33 [interface.py:247] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(trust_remote_code=False, seed=20826811, num_prompts=4, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:11435', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='Qwen3.8-27B-Quark-AWQ-MXFP4', input_len=2048, output_len=64, tokenizer='/nvme/lexar-2/ai/models/Qwen3.8-27B-Quark-AWQ-MXFP4-amd', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-bb23a85b-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-08 17:25:34 [utils.py:90] Sampling input_len from [2048, 2048] and output_len from [64, 64]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     4         
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  2.37      
Total input tokens:                      8192      
Total generated tokens:                  256       
Request throughput (req/s):              1.69      
Output token throughput (tok/s):         108.22    
Peak output token throughput (tok/s):    32.00     
Peak concurrent requests:                4.00      
Total token throughput (tok/s):          3571.40   
---------------Time to First Token----------------
Mean TTFT (ms):                          1365.82   
Median TTFT (ms):                        1589.14   
P50 TTFT (ms):                           1589.14   
P90 TTFT (ms):                           1844.64   
P95 TTFT (ms):                           1844.68   
P99 TTFT (ms):                           1844.71   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.82     
Median TPOT (ms):                        11.12     
P50 TPOT (ms):                           11.12     
P90 TPOT (ms):                           23.21     
P95 TPOT (ms):                           25.19     
P99 TPOT (ms):                           26.77     
---------------Inter-token Latency----------------
Mean ITL (ms):                           68.29     
Median ITL (ms):                         33.65     
P50 ITL (ms):                            33.65     
P90 ITL (ms):                            37.22     
P95 ITL (ms):                            273.93    
P99 ITL (ms):                            702.27    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          2236.47   
Median E2EL (ms):                        2214.68   
P50 E2EL (ms):                           2214.68   
P90 E2EL (ms):                           2319.94   
P95 E2EL (ms):                           2342.47   
P99 E2EL (ms):                           2360.50   
---------------Speculative Decoding---------------
Acceptance rate (%):                     58.54     
Acceptance length:                       5.10      
Drafts:                                  51        
Draft tokens:                            357       
Accepted tokens:                         209       
Per-position acceptance (%):
  Position 0:                            68.63     
  Position 1:                            60.78     
  Position 2:                            60.78     
  Position 3:                            56.86     
  Position 4:                            56.86     
  Position 5:                            52.94     
  Position 6:                            52.94     
==================================================